app/controllers/ballots_controller.rb

SELECT * FROM `ballots` WHERE (`ballots`.election_id = 1) LIMIT 1
---
  def index
    @ballots = Ballot.find(:all)

SELECT * FROM "ballots" WHERE ("ballots".election_id = 2) LIMIT 1
---
  def show
    @ballot = Ballot.find(params[:id])

SELECT * FROM "elections" WHERE ("elections"."id" = 1)
---
  def new
    @ballot = Ballot.new
    @election = Election.find(params[:election_id])

INSERT INTO "ballots" ("election_id", "updated_at", "issue", "created_at") VALUES(1, '2009-03-19 00:24:38', 'Fred should be Censor.', '2009-03-19 00:24:38')
---
  def create
    @ballot = Ballot.new(params[:ballot])

    respond_to do |format|
      if @ballot.save