app/controllers/elections_controller.rb

  def show
    @election = Election.find(params[:id])
---
SELECT * FROM "elections" WHERE ("elections"."id" = 1)

  def edit
    @election = Election.find(params[:id])
---
SELECT * FROM "elections" WHERE ("elections"."id" = 1)

  def create
    @election = Election.new(params[:election])

    respond_to do |format|
      if @election.save
---
INSERT INTO "elections" ("updated_at", "enddate", "presmag", "centprae", "comitia", "startdate", "created_at") VALUES('2009-03-18 23:27:56', '2009-04-14 23:59:00', 'Consul', 7, 'Populi Tributa', '2009-04-01 00:00:00', '2009-03-18 23:27:56')

  def update
    @election = Election.find(params[:id])

    respond_to do |format|
      if @election.update_attributes(params[:election])
---
SELECT * FROM "elections" WHERE ("elections"."id" = 1)
UPDATE "elections" SET "presmag" = 'Consul Severus', "updated_at" = '2009-03-18 23:32:28' WHERE "id" = 1